tests/pyCompare/sedim2D/0_org/Ws
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ws;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    sides
    {
        type           fixedValue;
        value          uniform (0 0 0);
    }

    top
    {
        type           fixedValue;
	value          uniform (0 0 0);
    }
    
    bed
    {
        type            zeroGradient;
    }
    
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
