tests/pyCompare/sedim2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler implicit;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
// UEqn
    div(phi,U)      Gauss upwind phi;
// CsEqn
    div(phip,Cs)      Gauss linearUpwind phip;
// pEqn
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         none;
    // cell displacements
    laplacian(diffusivity,cellDisplacement) Gauss linear corrected;
    // UEqn
    laplacian(nuEff,U) Gauss linear corrected;
    // pEqn
    laplacian((1|A(U)),p) Gauss linear corrected;
    laplacian(rAUf,pcorr) Gauss linear orthogonal;
    // CsEqn
    laplacian(diffSed,Cs) Gauss linear corrected;
}

interpolationSchemes
{
    default  linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p                 ;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
